wikimedia/smash-pig/Tests/SoapInjector/notification_test.xml

<?xml version="1.0" ?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soap:Body>
		<ns1:sendNotification xmlns:ns1="http://notification.services.adyen.com">
			<ns1:notification>
				<live xmlns="http://notification.services.adyen.com">false</live>
				<notificationItems xmlns="http://notification.services.adyen.com">
					<NotificationRequestItem>
						<additionalData xsi:nil="true"/>
						<amount>
							<currency xmlns="http://common.services.adyen.com">EUR</currency>
							<value xmlns="http://common.services.adyen.com">11099</value>
						</amount>
						<eventCode>NOTIFICATIONTEST</eventCode>
						<eventDate>2012-12-14T01:38:57.522+01:00</eventDate>
						<merchantAccountCode>WikimediaCOM</merchantAccountCode>
						<merchantReference>n/a</merchantReference>
						<operations xsi:nil="true"/>
						<originalReference xsi:nil="true"/>
						<paymentMethod>bankTransfer_NL</paymentMethod>
						<pspReference>testnotification_NOTIFICATIONTEST</pspReference>
						<reason xsi:nil="true"/>
						<success>true</success>
					</NotificationRequestItem>
					<NotificationRequestItem>
						<additionalData xsi:nil="true"/>
						<amount>
							<currency xmlns="http://common.services.adyen.com">GBP</currency>
							<value xmlns="http://common.services.adyen.com">9911</value>
						</amount>
						<eventCode>NOTIFICATIONTEST</eventCode>
						<eventDate>2012-12-14T01:38:57.522+01:00</eventDate>
						<merchantAccountCode>WikimediaCOM</merchantAccountCode>
						<merchantReference>n/a</merchantReference>
						<operations xsi:nil="true"/>
						<originalReference xsi:nil="true"/>
						<paymentMethod>bcmc</paymentMethod>
						<pspReference>testnotification_NOTIFICATIONTEST</pspReference>
						<reason xsi:nil="true"/>
						<success>true</success>
					</NotificationRequestItem>
				</notificationItems>
			</ns1:notification>
		</ns1:sendNotification>
	</soap:Body>
</soap:Envelope>
